leoembeddeder/stm32_example/App/Src/uds_bootloader.c
static UdsDownloadResult bootloader_flash_program(void *context, uint32_t address,
                                                  const uint8_t *data, uint16_t length) {
    (void)context;
#if defined(HAL_FLASH_MODULE_ENABLED)
    HAL_FLASH_Unlock();
#if defined(STM32F767xx)
    for (uint32_t i = 0U; i < (uint32_t)length; i += 4U) {
        uint32_t word = 0xFFFFFFFFUL;
        size_t chunk_len = ((uint32_t)length - i < 4U) ? (size_t)((uint32_t)length - i) : 4U;
        (void)memcpy(&word, &data[i], chunk_len);
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address + i, (uint64_t)word) != HAL_OK) {
            HAL_FLASH_Lock();
            return UDS_DOWNLOAD_PROGRAM_ERROR;
        }
    }
#elif defined(STM32C092xx) || defined(STM32C0xx)
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);
    size_t i = 0U;
    while ((i + 8U) <= (size_t)length) {
        uint64_t dword_val = 0U;
        (void)memcpy(&dword_val, &data[i], 8U);
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, address + i, dword_val) != HAL_OK) {
            HAL_FLASH_Lock();
            return UDS_DOWNLOAD_PROGRAM_ERROR;
        }
        i += 8U;
    }
    if (i < (size_t)length) {
        uint64_t dword_val = 0xFFFFFFFFFFFFFFFFULL;
        (void)memcpy(&dword_val, &data[i], (size_t)length - i);
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, address + i, dword_val) != HAL_OK) {
            HAL_FLASH_Lock();
            return UDS_DOWNLOAD_PROGRAM_ERROR;
        }
    }
#endif
    HAL_FLASH_Lock();
#else
    (void)address;
    if ((data != NULL) && (length > 0U)) {
        if ((s_mock_flash_len + (uint32_t)length) <= sizeof(s_mock_flash_mem)) {
            (void)memcpy(&s_mock_flash_mem[s_mock_flash_len], data, (size_t)length);
            s_mock_flash_len += (uint32_t)length;
        }
    }
#endif
    return UDS_DOWNLOAD_OK;
}

static UdsDownloadResult bootloader_flash_verify(void *context, const UdsDownloadMetadata *metadata,
                                                 uint32_t expected_crc32, bool has_expected_crc32) {
    (void)context;
    if ((metadata == NULL) || (metadata->image_length == 0U)) {
        return UDS_DOWNLOAD_INVALID_ARGUMENT;
    }

    uint32_t computed_flash_crc = 0U;
#if defined(HAL_FLASH_MODULE_ENABLED)
    const uint8_t *flash_ptr = (const uint8_t *)(uintptr_t)metadata->image_address;
    computed_flash_crc = bootloader_calc_crc32(flash_ptr, metadata->image_length);
#else
    if ((s_mock_flash_len > 0U) && (s_mock_flash_len == metadata->image_length)) {
        computed_flash_crc = bootloader_calc_crc32(s_mock_flash_mem, metadata->image_length);
    } else {
        computed_flash_crc = metadata->crc32 ^ 0xFFFFFFFFUL;
    }
#endif

    if (has_expected_crc32) {
        if (computed_flash_crc != expected_crc32) {
            return UDS_DOWNLOAD_VERIFY_ERROR;
        }
    } else {
        if ((metadata->crc32 != 0xFFFFFFFFUL) &&
            (computed_flash_crc != (metadata->crc32 ^ 0xFFFFFFFFUL))) {
            return UDS_DOWNLOAD_VERIFY_ERROR;
        }
    }

    return UDS_DOWNLOAD_OK;
}

UdsDownloadResult uds_bootloader_flash_verify(const UdsDownloadMetadata *metadata,
                                              uint32_t expected_crc32, bool has_expected_crc32) {
    return bootloader_flash_verify(NULL, metadata, expected_crc32, has_expected_crc32);
}

UdsDownloadResult uds_bootloader_flash_erase_poll(void) {
    return bootloader_flash_erase_poll(NULL);
}

void uds_bootloader_set_target(UdsBootloaderTarget target) {
    s_bl_ctx.target = target;
    s_bl_ctx.active_version = 1U;
    s_bl_ctx.download_in_progress = false;
    s_bl_ctx.candidate_verified = false;
    s_bl_ctx.last_erase_result = 0x00U;
    s_bl_ctx.last_check_memory_result = 0x01U;
    (void)memset(&s_bl_ctx.staging_metadata, 0, sizeof(s_bl_ctx.staging_metadata));

    if (target == UDS_BL_TARGET_STM32C092) {
        s_bl_ctx.active_slot_addr = UDS_BL_C092_APP_SLOT_A_START;
        s_bl_ctx.active_slot_size = UDS_BL_C092_APP_SLOT_A_SIZE;
        s_bl_ctx.target_slot_addr = UDS_BL_C092_APP_SLOT_B_START;
        s_bl_ctx.target_slot_size = UDS_BL_C092_APP_SLOT_B_SIZE;

        s_bl_memory_map.staging_image.start = UDS_BL_C092_APP_SLOT_B_START;
        s_bl_memory_map.staging_image.end_exclusive =
            UDS_BL_C092_APP_SLOT_B_START + UDS_BL_C092_APP_SLOT_B_SIZE;
        s_bl_memory_map.bootloader.start = UDS_BL_C092_BOOTLOADER_START;
        s_bl_memory_map.bootloader.end_exclusive =
            UDS_BL_C092_BOOTLOADER_START + UDS_BL_C092_BOOTLOADER_SIZE;
        s_bl_memory_map.active_application.start = UDS_BL_C092_APP_SLOT_A_START;
        s_bl_memory_map.active_application.end_exclusive =
            UDS_BL_C092_APP_SLOT_A_START + UDS_BL_C092_APP_SLOT_A_SIZE;
        s_bl_memory_map.persistent_storage.start = UDS_BL_C092_NVM_METADATA_START;
        s_bl_memory_map.persistent_storage.end_exclusive =
            UDS_BL_C092_NVM_METADATA_START + UDS_BL_C092_NVM_METADATA_SIZE;
        s_bl_memory_map.diagnostic_storage.start = UDS_BL_C092_NVM_METADATA_START;
        s_bl_memory_map.diagnostic_storage.end_exclusive =
            UDS_BL_C092_NVM_METADATA_START + UDS_BL_C092_NVM_METADATA_SIZE;
        s_bl_memory_map.erase_alignment = 8U;
        s_bl_memory_map.program_alignment = 8U;
        s_bl_memory_map.max_block_length = 256U;
        s_bl_memory_map.activation_supported = true;
    } else {
        s_bl_ctx.active_slot_addr = UDS_BL_F767_APP_SLOT_A_START;
        s_bl_ctx.active_slot_size = UDS_BL_F767_APP_SLOT_A_SIZE;
        s_bl_ctx.target_slot_addr = UDS_BL_F767_APP_SLOT_B_START;
        s_bl_ctx.target_slot_size = UDS_BL_F767_APP_SLOT_B_SIZE;

        s_bl_memory_map.staging_image.start = UDS_BL_F767_APP_SLOT_B_START;
        s_bl_memory_map.staging_image.end_exclusive =
            UDS_BL_F767_APP_SLOT_B_START + UDS_BL_F767_APP_SLOT_B_SIZE;
        s_bl_memory_map.bootloader.start = UDS_BL_F767_BOOTLOADER_START;
        s_bl_memory_map.bootloader.end_exclusive =
            UDS_BL_F767_BOOTLOADER_START + UDS_BL_F767_BOOTLOADER_SIZE;
        s_bl_memory_map.active_application.start = UDS_BL_F767_APP_SLOT_A_START;
        s_bl_memory_map.active_application.end_exclusive =
            UDS_BL_F767_APP_SLOT_A_START + UDS_BL_F767_APP_SLOT_A_SIZE;
        s_bl_memory_map.persistent_storage.start = UDS_BL_F767_NVM_METADATA_START;
        s_bl_memory_map.persistent_storage.end_exclusive =
            UDS_BL_F767_NVM_METADATA_START + 0x8000UL;
        s_bl_memory_map.diagnostic_storage.start = UDS_BL_F767_NVM_METADATA_START + 0x8000UL;
        s_bl_memory_map.diagnostic_storage.end_exclusive = UDS_BL_F767_APP_SLOT_A_START;
        s_bl_memory_map.erase_alignment = 4U;
        s_bl_memory_map.program_alignment = 4U;
        s_bl_memory_map.max_block_length = 256U;
        s_bl_memory_map.activation_supported = true;
    }

    UdsDownloadCallbacks dl_callbacks = {
        .erase_start = bootloader_flash_erase_start,
        .erase_poll = bootloader_flash_erase_poll,
        .program = bootloader_flash_program,
        .verify_image = bootloader_flash_verify,
        .abort = NULL,
        .watchdog_kick = NULL,
    };
    uds_download_init(&s_bl_download, &s_bl_memory_map, &dl_callbacks, &s_bl_ctx);
}

void uds_bootloader_init(void) {
#if defined(STM32C092xx) || defined(TARGET_STM32C092)
    uds_bootloader_set_target(UDS_BL_TARGET_STM32C092);
#else
    uds_bootloader_set_target(UDS_BL_TARGET_STM32F767);
#endif
}

UdsBootloaderTarget uds_bootloader_get_target(void) {
    return s_bl_ctx.target;
}

