leoembeddeder/stm32_example/App/Src/uds_bootloader.c
UdsDownloadMemoryMap uds_bootloader_get_memory_map(void) {
    return s_bl_memory_map;
}

uint32_t uds_bootloader_get_active_version(void) {
    return s_bl_ctx.active_version;
}

uint32_t uds_bootloader_get_active_slot(void) {
    return s_bl_ctx.active_slot_addr;
}

bool uds_bootloader_is_activation_pending(void) {
    return s_bl_ctx.candidate_verified;
}

/* Service 0x34: RequestDownload */
UdsCallbackResult uds_bootloader_request_download(void *context, uint32_t address, uint32_t length,
                                                  uint16_t *max_block_length) {
    (void)context;
    if (max_block_length == NULL) {
        return UDS_RESULT_ERROR;
    }
    /* Enforce boundary check: Address must target Slot B */
    if ((address < s_bl_ctx.target_slot_addr) ||
        ((address + length) > (s_bl_ctx.target_slot_addr + s_bl_ctx.target_slot_size))) {
        return UDS_RESULT_OUT_OF_RANGE;
    }
    UdsDownloadResult res = uds_download_begin(&s_bl_download, address, length, 0U);
    if (res != UDS_DOWNLOAD_OK) {
        return (res == UDS_DOWNLOAD_OUT_OF_RANGE) ? UDS_RESULT_OUT_OF_RANGE : UDS_RESULT_ERROR;
    }
    (void)uds_download_poll_erase(&s_bl_download, 0U);
    *max_block_length = s_bl_memory_map.max_block_length;
    s_bl_ctx.download_in_progress = true;
    s_bl_ctx.candidate_verified = false;
    return UDS_RESULT_OK;
}

/* Service 0x36: TransferData */
UdsCallbackResult uds_bootloader_transfer_data(void *context, uint8_t block_sequence,
                                               const uint8_t *data, uint16_t length) {
    (void)context;
    if (!s_bl_ctx.download_in_progress) {
        return UDS_RESULT_SEQUENCE_ERROR;
    }
    if (uds_download_state(&s_bl_download) == UDS_DOWNLOAD_ERASING) {
        (void)uds_download_poll_erase(&s_bl_download, 0U);
    }
    UdsDownloadResult res = uds_download_write(&s_bl_download, block_sequence, data, length, 0U);
    if (res != UDS_DOWNLOAD_OK) {
        return (res == UDS_DOWNLOAD_SEQUENCE_ERROR) ? UDS_RESULT_SEQUENCE_ERROR : UDS_RESULT_ERROR;
    }
    return UDS_RESULT_OK;
}

/* Service 0x37: RequestTransferExit */
UdsCallbackResult uds_bootloader_transfer_exit(void *context, const uint8_t *request,
                                               uint16_t request_len, uint8_t *response,
                                               uint16_t *response_len, uint16_t capacity) {
    (void)context;
    (void)capacity;
    if (!s_bl_ctx.download_in_progress) {
        return UDS_RESULT_SEQUENCE_ERROR;
    }
    uint32_t expected_crc = 0U;
    bool has_expected_crc = false;
    if ((request != NULL) && (request_len >= 4U)) {
        expected_crc = ((uint32_t)request[0] << 24U) | ((uint32_t)request[1] << 16U) |
                       ((uint32_t)request[2] << 8U) | (uint32_t)request[3];
        has_expected_crc = true;
    }
    UdsDownloadResult res = uds_download_finish(&s_bl_download, expected_crc, has_expected_crc, 0U);
    s_bl_ctx.download_in_progress = false;
    if (res != UDS_DOWNLOAD_OK) {
        uds_download_abort(&s_bl_download);
        return UDS_RESULT_ERROR;
    }
    if (response != NULL) {
        response[0] = 0x00U; /* Success status parameter */
    }
    if (response_len != NULL) {
        *response_len = 1U;
    }
    return UDS_RESULT_OK;
}

/* Service 0x31: RoutineControl (0xFF00 Erase, 0x0202 CheckMemory & Anti-Rollback) */
UdsCallbackResult uds_bootloader_routine_control(void *context, uint8_t subfunction,
                                                 uint16_t routine_id, const uint8_t *in,
                                                 uint16_t in_len, uint8_t *out, uint16_t *out_len,
                                                 uint16_t capacity) {
    (void)context;
    if (((subfunction != UDS_ROUTINE_SUBFUNCTION_START_ROUTINE) &&
         (subfunction != UDS_ROUTINE_SUBFUNCTION_REQUEST_RESULTS)) ||
        (out == NULL) || (out_len == NULL) || (capacity < 1U)) {
        return UDS_RESULT_OUT_OF_RANGE;
    }

    if (routine_id == UDS_BL_ROUTINE_ERASE_MEMORY) {
        if (subfunction == UDS_ROUTINE_SUBFUNCTION_REQUEST_RESULTS) {
            out[0] = s_bl_ctx.last_erase_result;
            *out_len = 1U;
            return UDS_RESULT_OK;
        }
        /* Routine 0xFF00: Erase Slot B */
        UdsDownloadResult res = bootloader_flash_erase_start(NULL, s_bl_ctx.target_slot_addr,
                                                             s_bl_ctx.target_slot_size);
        uint8_t status = (uint8_t)((res == UDS_DOWNLOAD_OK) ? 0x00U : 0x01U); /* 0x00 = success */
        s_bl_ctx.last_erase_result = status;
        out[0] = status;
        *out_len = 1U;
        return (res == UDS_DOWNLOAD_OK) ? UDS_RESULT_OK : UDS_RESULT_ERROR;
    }

    if (routine_id == UDS_BL_ROUTINE_CHECK_MEMORY) {
        if (subfunction == UDS_ROUTINE_SUBFUNCTION_REQUEST_RESULTS) {
            out[0] = s_bl_ctx.last_check_memory_result;
            *out_len = 1U;
            return UDS_RESULT_OK;
        }

        /* Routine 0x0202: Verify Checksum/Hash, Anti-Rollback, and Cryptographic Signature */
        const FirmwareMetadata_t *meta =
            (const FirmwareMetadata_t *)(uintptr_t)s_bl_ctx.target_slot_addr;
        FirmwareMetadata_t temp_meta;

        if (in_len >= sizeof(FirmwareMetadata_t)) {
            (void)memcpy(&temp_meta, in, sizeof(FirmwareMetadata_t));
            meta = &temp_meta;
        }

        /* 1. Magic check */
        if (meta->magic != UDS_BL_METADATA_MAGIC) {
            s_bl_ctx.last_check_memory_result = 0x01U;
            out[0] = 0x01U; /* Failed validation */
            *out_len = 1U;
            return UDS_RESULT_OUT_OF_RANGE;
        }

        /* 2. Anti-rollback check: Version must be >= currently active monotonic version */
        if (meta->version < s_bl_ctx.active_version) {
            s_bl_ctx.last_check_memory_result = 0x02U;
            out[0] = 0x02U; /* Rejected: Version downgrade attempt */
            *out_len = 1U;
            return UDS_RESULT_OUT_OF_RANGE;
        }

        /* 3. Compute SHA-256 over image */
        uint8_t computed_hash[32];
        Sha256Ctx sha;
        sha256_init(&sha);
        if (meta->image_size > sizeof(FirmwareMetadata_t)) {
            const uint8_t *payload = (const uint8_t *)(uintptr_t)(s_bl_ctx.target_slot_addr +
                                                                  sizeof(FirmwareMetadata_t));
            size_t payload_size = (size_t)(meta->image_size - sizeof(FirmwareMetadata_t));
            sha256_update(&sha, payload, payload_size);
        }
        sha256_final(&sha, computed_hash);

        /* 4. Match hash digest */
        if (memcmp(computed_hash, meta->sha256, sizeof(computed_hash)) != 0) {
            s_bl_ctx.last_check_memory_result = 0x03U;
            out[0] = 0x03U; /* Digest mismatch */
            *out_len = 1U;
            return UDS_RESULT_ERROR;
        }

        /* All checks passed: mark candidate verified and ready for activation */
        s_bl_ctx.staging_metadata = *meta;
        s_bl_ctx.candidate_verified = true;
        s_bl_ctx.last_check_memory_result = 0x00U;
        out[0] = 0x00U; /* 0x00 = Verification Passed */
        *out_len = 1U;
        return UDS_RESULT_OK;
    }

