leoembeddeder/stm32_example/App/Src/uds_bootloader.c
    return UDS_RESULT_NOT_SUPPORTED;
}

/* Vector Table Sanity Validation Gate (S32K144 / OpenBLT specification) */
bool uds_bootloader_is_application_valid(uint32_t app_vector_addr) {
    uint32_t flash_base = (s_bl_ctx.target == UDS_BL_TARGET_STM32C092) ? UDS_BL_C092_FLASH_BASE
                                                                       : UDS_BL_F767_FLASH_BASE;
    uint32_t flash_end = (s_bl_ctx.target == UDS_BL_TARGET_STM32C092)
                             ? (UDS_BL_C092_FLASH_BASE + UDS_BL_C092_FLASH_SIZE)
                             : (UDS_BL_F767_FLASH_BASE + UDS_BL_F767_FLASH_SIZE);
    uint32_t ram_start = (s_bl_ctx.target == UDS_BL_TARGET_STM32C092) ? UDS_BL_C092_RAM_START
                                                                      : UDS_BL_F767_RAM_START;
    uint32_t ram_end =
        (s_bl_ctx.target == UDS_BL_TARGET_STM32C092) ? UDS_BL_C092_RAM_END : UDS_BL_F767_RAM_END;

    if ((app_vector_addr < flash_base) || (app_vector_addr >= flash_end)) {
        return false;
    }

    /* Hardware VTOR alignment: 256-byte aligned on Cortex-M0+, 512-byte aligned on Cortex-M7 */
    uint32_t vtor_alignment_mask = (s_bl_ctx.target == UDS_BL_TARGET_STM32C092) ? 0xFFU : 0x1FFU;
    if ((app_vector_addr & vtor_alignment_mask) != 0U) {
        return false;
    }
    const uint32_t *vectors = (const uint32_t *)(uintptr_t)app_vector_addr;
    uint32_t initial_msp = vectors[0];
    uint32_t reset_handler = vectors[1];

    /* 1. Initial MSP must be in SRAM bounds and aligned */
    if ((initial_msp < ram_start) || (initial_msp > ram_end) || ((initial_msp & 0x3U) != 0U)) {
        return false;
    }

    /* 2. Reset Handler must have Thumb bit set and be non-erased */
    if (((reset_handler & 0x1U) == 0U) || (reset_handler == 0xFFFFFFFFUL)) {
        return false;
    }

    uint32_t reset_addr = reset_handler & ~1U;
    if ((reset_addr < app_vector_addr) || (reset_addr >= flash_end)) {
        return false;
    }
    return true;
}

typedef void (*AppEntryFn)(void);

/* Vector Jump, Barrier Synchronization & Cache Maintenance */
void uds_bootloader_jump_to_app(uint32_t app_vector_addr) {
#if defined(STM32C092xx) || defined(CORTEX_M0PLUS)
    /* Sanity gate: Validate vector table before attempting execution */
    if (!uds_bootloader_is_application_valid(app_vector_addr)) {
        return;
    }

    uint32_t app_msp = *(__IO uint32_t *)(uintptr_t)app_vector_addr;
    AppEntryFn app_entry =
        (AppEntryFn)(uintptr_t)(*(__IO uint32_t *)(uintptr_t)(app_vector_addr + 4U));

    /* 1. Disable all interrupts */
    __disable_irq();

    /* 2. Disable SysTick timer and clear pending register */
    SysTick->CTRL = 0U;
    SysTick->LOAD = 0U;
    SysTick->VAL = 0U;

    /* 3. Disable all peripherals & clear NVIC pending interrupts (single 32-bit register on Cortex-M0+) */
    NVIC->ICER[0] = 0xFFFFFFFFUL;
    NVIC->ICPR[0] = 0xFFFFFFFFUL;

    /* 4. Set Vector Table Offset Register (VTOR) */
    SCB->VTOR = app_vector_addr;

    /* 5. Reset CONTROL register to Privileged Thread Mode on MSP */
    __set_CONTROL(0U);

    /* 6. Memory Synchronization Barriers */
    __DSB();
    __ISB();

    /* 7. Set Main Stack Pointer and branch to reset handler */
    __set_MSP(app_msp);
    app_entry();
#elif defined(CORTEX_M7) || defined(STM32F767xx)
    /* Sanity gate: Validate vector table before attempting execution */
    if (!uds_bootloader_is_application_valid(app_vector_addr)) {
        return;
    }

    uint32_t app_msp = *(__IO uint32_t *)(uintptr_t)app_vector_addr;
    AppEntryFn app_entry =
        (AppEntryFn)(uintptr_t)(*(__IO uint32_t *)(uintptr_t)(app_vector_addr + 4U));

    /* 1. Disable all interrupts */
    __disable_irq();

    /* 2. Disable SysTick timer and clear pending register */
    SysTick->CTRL = 0U;
    SysTick->LOAD = 0U;
    SysTick->VAL = 0U;

    /* 3. Disable all peripherals & clear NVIC pending interrupts */
    for (uint32_t i = 0U; i < 8U; i++) {
        NVIC->ICER[i] = 0xFFFFFFFFUL;
        NVIC->ICPR[i] = 0xFFFFFFFFUL;
    }

    /* 4. Clear pending system exceptions (PendSV, SysTick) */
    SCB->ICSR = SCB_ICSR_PENDSTCLR_Msk | SCB_ICSR_PENDSVCLR_Msk;

    /* 5. Disable and clean Cortex-M7 L1 Caches */
    SCB_DisableICache();
    SCB_DisableDCache();
    SCB_InvalidateICache();
    SCB_CleanInvalidateDCache();

    /* 6. Set Vector Table Offset Register (VTOR) */
    SCB->VTOR = app_vector_addr;

    /* 7. Reset CONTROL register to Privileged Thread Mode on MSP */
    __set_CONTROL(0U);

    /* 8. Memory Synchronization Barriers */
    __DSB();
    __ISB();

    /* 9. Set Main Stack Pointer and branch to reset handler */
    __set_MSP(app_msp);
    app_entry();
#else
    (void)app_vector_addr;
#endif
}
